In [1]:
import pandas as pd

data_one = {
    "col_a": [1,2,3,4],
    "col_b": ["a", "b", "c", "d"],
    "col_c": [True, False, False, False]
}

data_two = {
    "col_a": [1,21,3,14],
    "col_b": ["m", "b", "n", "d"],
    "col_c": [True, False, True, True]
}

df_one = pd.DataFrame(data_one)
df_two = pd.DataFrame(data_two)

df_one

   col_a col_b  col_c
0      1     a   True
1      2     b  False
2      3     c  False
3      4     d  False

In [2]:
df_two

   col_a col_b  col_c
0      1     m   True
1     21     b  False
2      3     n   True
3     14     d   True

In [4]:
df = pd.concat([df_one, df_two])
df

   col_a col_b  col_c
0      1     a   True
1      2     b  False
2      3     c  False
3      4     d  False
0      1     m   True
1     21     b  False
2      3     n   True
3     14     d   True

In [6]:
df = pd.concat([df_one, df_two], keys=["df1", "df2"])
df

       col_a col_b  col_c
df1 0      1     a   True
    1      2     b  False
    2      3     c  False
    3      4     d  False
df2 0      1     m   True
    1     21     b  False
    2      3     n   True
    3     14     d   True

In [7]:
df = pd.concat([df_one, df_two], ignore_index=True)
df

   col_a col_b  col_c
0      1     a   True
1      2     b  False
2      3     c  False
3      4     d  False
4      1     m   True
5     21     b  False
6      3     n   True
7     14     d   True

In [8]:
df = pd.concat([df_one, df_two], axis=1)
df

   col_a col_b  col_c  col_a col_b  col_c
0      1     a   True      1     m   True
1      2     b  False     21     b  False
2      3     c  False      3     n   True
3      4     d  False     14     d   True

In [9]:
df_one

   col_a col_b  col_c
0      1     a   True
1      2     b  False
2      3     c  False
3      4     d  False

In [10]:
df_two

   col_a col_b  col_c
0      1     m   True
1     21     b  False
2      3     n   True
3     14     d   True